Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: The selected directories are searched recursively.
ja: 選択されたディレクトリは再帰的に検索される。

source: The selection, if any, is always shown, even if the control does not have keyboard focus.
ja: コントロールにキーボード・フォーカスがなくても、選択範囲があれば常に表示される。

source: The sequence of keys to send (see the Send function for details).
ja: 送信するキー（詳しくはSend関数をご覧ください）。

source: The sequence of keys to send.
ja: 送信するキーのシーケンス。

source: The setting of #MaxThreads -- if lower than this setting -- takes precedence.
ja: #MaxThreadsの設定値がこの設定値より低い場合は、その設定値が優先されます。

source: The shortcut to the script should now be in the Startup folder.
ja: これで、スクリプトへのショートカットがスタートアップフォルダに入るはずです。

source: The sign of the result is always the same as the sign of the first parameter.
ja: 結果の符号は、常に第1パラメータの符号と同じになります。

source: The simplest alternative is to Run a new instance and then exit.
ja: 最も簡単な方法は、新しいインスタンスを実行し、終了することです。

source: The simplest assignment operator is colon-equal (:=), which stores the result of an expression in a variable.
ja: 最も単純な代入演算子はコロン等号（:=）で、式の結果を変数に格納する。

source: The simplest backreferences are $0 through $9, where $0 is the substring that matched the entire pattern, $1 is the substring that matched the first subpattern, $2 is the second, and so on.
ja: 最も単純な後方参照は$0から$9で、$0はパターン全体に一致した部分文字列、$1は最初の部分パターンに一致した部分文字列、$2は2番目、といった具合になります。

source: The simplest use of a map is to retrieve or set a key-value pair via the implicit __Item property, by simply writing the key between brackets following the map object.
ja: マップの最も単純な使用方法は、暗黙の__Itemプロパティによってキーと値のペアを取得または設定することであり、マップオブジェクトの後に続く括弧の間にキーを記述するだけです。

source: The size in Kbytes of the file currently retrieved, rounded down to the nearest integer.
ja: 現在取得中のファイルのサイズ（Kbyte）を、最も近い整数に切り捨てたもの。

source: The size in Mbytes of the file currently retrieved, rounded down to the nearest integer.
ja: 現在取得中のファイルのサイズ（Mbyte）。小数点以下は切り捨てます。

source: The size in bytes of the file currently retrieved.
ja: 現在取得中のファイルのサイズ（バイト数）です。

source: The size of each dimension.
ja: 各寸法の大きさです。

source: The size of the on-screen keyboard can be customized at the top of the script.
ja: オンスクリーンキーボードのサイズは、スクリプトの上部でカスタマイズできる。

source: The size, in bytes, of the raw binary data.
ja: 未加工のバイナリデータのサイズ（バイト単位）です。

source: The smallest element in a UTF-16 string is two bytes (16 bits).
ja: UTF-16文字列の最小の要素は2バイト（16ビット）です。

source: The smallest element of an ANSI string is one byte.
ja: ANSI文字列の最小の要素は1バイトです。

source: The sort compares each string to the others starting at its nth character.
ja: ソートは各文字列をn文字目から他の文字列と比較する。

source: The sorting of the column is case insensitive based on the current user's locale (affects only text columns).
ja: カラムのソートは、現在のユーザーのロケールに基づき、大文字と小文字を区別しません（テキストカラムにのみ影響します）。

source: The sorting of the column is case sensitive (affects only text columns).
ja: カラムのソートは大文字と小文字を区別します（テキストカラムにのみ影響します）。

source: The source code for a work means the preferred form of the work for making modifications to it.
ja: ある作品のソースコードとは、その作品に改変を加えるために望ましい形式を意味する。

source: The source file does not exist (only for uncompiled scripts).
ja: ソースファイルが存在しない（コンパイルされていないスクリプトの場合のみ）。

source: The space after if is optional if the expression starts with an open-parenthesis, as in if(expression).
ja: if(expression)のように、式が開括弧で始まる場合、ifの後のスペースは任意です。

source: The space is ignored if both and + flags appear.
ja: と+フラグの両方が表示されている場合、スペースは無視されます。

source: The space or tab after Return is optional if the expression is enclosed in parentheses, as in return(expression).
ja: return(expression)のように式が括弧で囲まれている場合、Returnの後のスペースまたはタブは任意です。

source: The space or tab after Until is optional if the expression is enclosed in parentheses, as in until(expression).
ja: until(expression)のように式が括弧で囲まれているときは、Untilの後のスペースまたはタブは省略できます。

source: The space or tab after While is optional if the expression is enclosed in parentheses, as in While(expression).
ja: While(expression)のように式が括弧で囲まれている場合、Whileの後のスペースやタブは省略可能である。

source: The space or tab after throw is optional if the expression is enclosed in parentheses, as in throw(Error()).
ja: throw(Error())のように式が括弧で囲まれている場合、throwの後のスペースまたはタブはオプションである。

source: The specified DllFile could not be accessed or loaded.
ja: 指定されたDllFileは、アクセスまたはロードできませんでした。

source: The specified function could not be found inside the DLL.
ja: 指定された関数はDLL内に見つかりませんでした。

source: The specified numbers must be less than 65536, and the first must be less than or equal to the second.
ja: 指定された数値は65536以下でなければならず、最初の数値は2番目の数値以下でなければならない。

source: The speed of WinMove is affected by SetWinDelay.
ja: WinMoveの速度はSetWinDelayの影響を受ける。

source: The speed to move the mouse in the range 0 (fastest) to 100 (slowest).
ja: マウスを動かす速度を0（最速）～100（最遅）の範囲で指定します。

source: The standard AutoHotkey executable files can also be used as the base of a compiled script, by embedding a Win32 (RCDATA) resource with ID 1.
ja: 標準のAutoHotkey実行ファイルは、ID 1のWin32 (RCDATA)リソースを埋め込むことで、コンパイル済みスクリプトのベースとして使用することもできます。

source: The standard items are inserted after any existing items.
ja: 標準項目は、既存の項目の後に挿入されます。

source: The standard modifier keys are designed to be used in this manner, so normally have no immediate effect when pressed down.
ja: 標準装備の修飾キーは、このような使い方を想定して設計されているため、通常は押してもすぐには効果がありません。

source: The starting value for index is the lower bound of the ComObjArray (arr.MinIndex()), typically 0.
ja: indexの開始値はComObjArrayの下限値（arr.MinIndex()）であり、通常は0です。

source: The state cycles through checked, indeterminate, and cleared.
ja: 状態はチェック済み、不確定、クリアの順に循環する。

source: The state of CapsLock is not changed at all.
ja: CapsLockの状態は全く変化しません。

source: The static method __New is called for each class when it is initialized, if defined by that class or inherited from a superclass.
ja: 静的メソッド __New は、そのクラスで定義されているか、スーパークラスから継承されている場合、各クラスの初期化時に呼び出されます。

source: The string {Blind} must occur at the beginning of the string.
ja: 文字列{Blind}は、文字列の先頭に出現する必要があります。

source: The string corresponding to Number.
ja: Numberに対応する文字列。

source: The string is not required to be null-terminated if a Buffer-like object is provided, or if the Length parameter is specified.
ja: Bufferライクなオブジェクトが提供される場合、またはLengthパラメータが指定される場合、文字列はヌル終端である必要はない。

source: The string may contain binary zero.
ja: 文字列には2進数のゼロを含むことができます。

source: The string may start with a plus or minus sign and must not be empty.
ja: 文字列は、プラスまたはマイナスの記号で始まることができ、空であってはなりません。

source: The string may start with a plus sign, minus sign, or decimal point and must not be empty.
ja: 文字列は、プラス記号、マイナス記号、または小数点で始まることができ、空であってはなりません。

source: The string or number that will be written to the right of Key's equal sign (=).
ja: Keyの等号（=）の右側に書き込まれる文字列または数値です。

source: The string to add.
ja: 追加する文字列です。

source: The string to analyze.
ja: 解析する文字列です。

source: The string to be substituted for each match, which is plain text (not a regular expression).
ja: 各マッチで置換される文字列で、プレーンテキストです（正規表現ではありません）。

source: The string to choose.
ja: 選ぶべき文字列。

source: The string to convert.
ja: 変換する文字列。

source: The string to find.
ja: 見つけるための文字列です。

source: The string to paste.
ja: 貼り付ける文字列です。

source: The string to search for.
ja: 検索する文字列です。

source: The string whose content is copied.
ja: 内容がコピーされる文字列。

source: The string whose content is searched and replaced.
ja: 内容を検索・置換する文字列。

source: The string whose content is searched.
ja: 内容を検索する文字列。

source: The string whose contents will be measured.
ja: カウント対象の文字列です。

source: The string whose ordinal value is retrieved.
ja: 序列の値を取得する文字列。

source: The strings to be compared.
ja: 比較する文字列。

source: The style WS_CLIPSIBLINGS is always enabled and cannot be disabled, while TCS_OWNERDRAWFIXED is forced on or off as required by the control's background color and/or text color.
ja: スタイルWS_CLIPSIBLINGSは、常に有効であり、無効にすることはできません。一方、TCS_OWNERDRAWFIXEDは、コントロールの背景色やテキスト色によって強制的にオンまたはオフにされます。

source: The style LBS_NOTIFY (supports detection of double-clicks) is always enabled and cannot be disabled.
ja: LBS_NOTIFYスタイル（ダブルクリックの検出をサポート）は常に有効で、無効にすることはできません。

source: The style SS_ICON (for icons and cursors) or SS_BITMAP (for other image types) is always enabled and cannot be disabled.
ja: スタイル SS_ICON（アイコンとカーソル用）または SS_BITMAP（その他の画像タイプ用）は常に有効で、無効にすることはできません。

source: The sub-command keyword must be written literally; it must not be enclosed in quote marks and cannot be a variable or expression.
ja: サブコマンドキーワードは文字どおり書かなければなりません。引用符で囲むことはできず、変数や式にすることはできません。

source: The symbols < and > can be prefixed to any one of the above four modifiers to specify the left or right variant of that key.
ja: 記号<と>は、上記の4つの修飾子のいずれかに接頭して、そのキーの左または右のバリアントを指定することができます。

source: The syntax for Catch has been changed to provide a way to catch specific error classes, while leaving others uncaught (to transfer control to another Catch further up the call stack, or report the error and exit the thread).
ja: Catchの構文が変更され、特定のエラークラスをキャッチする一方、他のエラークラスはキャッチしない（コールスタックのさらに上の別のCatchに制御を移す、またはエラーを報告してスレッドを終了する）方法が提供されました。

source: The syntax for a RegEx callout in AutoHotkey is (?CNumber:Function), where both Number and Function are optional.
ja: AutoHotkeyのRegExコールアウトの構文は、(?CNumber:Function)で、NumberとFunctionの両方はオプションです。

source: The syntax for creating a ListView is:
ja: ListViewを作成するための構文です：

source: The syntax for creating a TreeView is:
ja: TreeViewを作成する構文は以下の通り：

source: The syntax for the built-in remapping feature is OriginKey::DestinationKey.
ja: 組み込みの再マッピング機能の構文はOriginKey::DestinationKeyです。

source: The syntax shown above is intended for use when the script obtains an icon or bitmap handle from another source, such as by sending the WM_GETICON message to a window.
ja: 上に示した構文は、スクリプトがウィンドウにWM_GETICONメッセージを送るなどして、他のソースからアイコンやビットマップハンドルを取得するときに使用するためのものです。

source: The system automatically seeds the random number generator, and does not provide a way to manually seed it, so there is no replacement for the NewSeed parameter.
ja: 乱数生成器の種付けはシステムが自動的に行い、手動で種付けする方法は提供しないため、NewSeedパラメータに代わるものはない。

source: The system cannot create cursors of other sizes.
ja: システムは他のサイズのカーソルを作成できない。

source: The system default ANSI code page.
ja: システムデフォルトのANSIコードページ。

source: The system has long path support enabled (requires Windows 10 version 1607 or later).
ja: ロングパスサポートが有効になっている（Windows 10 バージョン1607以降が必要）。

source: The system is being shut down or restarted, such as by the Shutdown function.
ja: シャットダウン機能などで、システムがシャットダウンまたは再起動中です。

source: The system's default language, which is one of these 4-digit codes.
ja: システムのデフォルト言語であり、4桁のコードのいずれかである。

source: The tab control does not receive the input focus when clicked.
ja: タブコントロールがクリックされたときに入力フォーカスを受け取らない。

source: The tab control has a tooltip control associated with it.
ja: タブ・コントロールにはツールチップ・コントロールが関連付けられている。

source: The tab control receives the input focus when clicked.
ja: タブコントロールは、クリックされると入力フォーカスを受け取ります。

source: The table below shows the closest equivalent property or function for each mode of GuiControl and control type.
ja: 下の表は、GuiControlの各モードとコントロールタイプについて、最も近い等価なプロパティまたは関数を示したものです。

source: The table below shows the closest equivalent property or function for each mode of GuiControlGet and control type.
ja: 下の表は、GuiControlGetの各モードとコントロールタイプに最も近い同等のプロパティまたは関数を示しています。

source: The table below shows the names and positions of the standard items after calling AddStandard on an empty menu:
ja: 空のメニューでAddStandardを呼び出した後の標準アイテムの名前と位置を下表に示します：

source: The target COM object; that is, a COM interface pointer.
ja: 対象となる COM オブジェクト、すなわち COM インタフェースポインタ。

source: The target control could not be found and Control-or-Pos does not specify a valid position.
ja: 対象コントロールが見つからず、Control-or-Posで有効な位置が指定されていない。

source: The target file is automatically closed after the text is appended (except when FileAppend is used in its single-parameter mode inside a file-reading/writing loop).
ja: テキストが追加された後、ターゲットファイルは自動的に閉じられます（FileAppendがファイルの読み書きのループ内でシングルパラメータモードで使用されている場合を除く）。

source: The target machine must be running the Remote Registry service.
ja: 対象マシンでは、リモートレジストリサービスが稼働している必要があります。

source: The target variable can be un-set by combining a direct assignment (:=) with the unset keyword or the maybe (var?) operator.
ja: 直接代入（:=）とunsetキーワード、またはmaybe（var?） 演算子を組み合わせることで、ターゲット変数を設定解除することができる。

source: The target window could not be found or does not contain a standard status bar.
ja: 対象のウィンドウが見つからないか、標準のステータスバーがない。

source: The target window could not be found.
ja: 対象のウィンドウが見つかりませんでした。

source: The target window must be active to have a focused control, but even the active window may lack a focused control.
ja: 対象ウィンドウがアクティブでなければフォーカスされたコントロールは得られませんが、アクティブなウィンドウであってもフォーカスされたコントロールがない場合があります。

source: The target window or control could not be found.
ja: 対象のウィンドウまたはコントロールが見つかりませんでした。

source: The template script is expected to create the file and open it for editing if applicable.
ja: テンプレート・スクリプトは、ファイルを作成し、該当する場合は編集用に開くことが期待される。

source: The template used to create the script and the location it will be saved can be configured within this window, and set as default if desired.
ja: スクリプトの作成に使用するテンプレートと保存場所は、このウィンドウで設定でき、必要に応じてデフォルトに設定することもできます。

source: The text entered by the user.
ja: ユーザーによって入力されたテキスト。

source: The text is case-sensitive and the matching behavior is determined by SetTitleMatchMode, similar to WinTitle below.
ja: テキストは大文字小文字を区別し、マッチング動作は以下のWinTitleと同様にSetTitleMatchModeによって決定される。

source: The text is formatted before it is displayed.
ja: テキストは表示される前に整形される。

source: The text of the input box, which is usually a message to the user indicating what kind of input is expected.
ja: 入力ボックスのテキスト。通常、どのような入力が期待されているかを示す、ユーザーへのメッセージです。

source: The text of the tooltip can be set via:
ja: ツールチップのテキストは、以下の方法で設定できる：

source: The text or raw binary data to append to the file.
ja: ファイルに追加するテキストまたは生のバイナリデータです。

source: The text retrieved is generally the same as what Window Spy shows for that window.
ja: 取得されるテキストは、通常、ウィンドスパイがそのウィンドウに対して表示するものと同じです。

source: The text starts after the single space following the Cont key-word.
ja: テキストはContキーワードに続く半角スペースの後に始まる。

source: The text to be appended to the previous directive line, before that line is processed.
ja: その行が処理される前に、前の指示行に追加されるテキスト。

source: The text to be shown.
ja: 表示するテキスト。

source: The text to display inside the message box.
ja: メッセージボックスの中に表示するテキストです。

source: The text to display on the menu item, or the position of an existing item to modify.
ja: メニュー項目に表示するテキスト、または修正する既存項目の位置を指定します。

source: The text to display on the menu item, or the position& of an existing item to modify.
ja: メニュー項目に表示するテキスト、または修正する既存項目の位置&を指定します。

source: The text to display on the menu item.
ja: メニュー項目に表示するテキストです。

source: The text to send to the debugger for display.
ja: デバッガに送信して表示させるテキストです。

source: The third parameter determines the type of message box.
ja: 3番目のパラメータはメッセージボックスのタイプを決定します。

source: The thread continues if the callback returns -1; otherwise the thread exits.
ja: コールバックが-1を返した場合はスレッドを継続し、それ以外の場合はスレッドを終了します。

source: The thread exits.
ja: スレッドは終了する。

source: The thread has been marked as critical.
ja: このスレッドはクリティカルとしてマークされている。

source: The thread has not been running long enough to meet the conditions for becoming interruptible, as set by Thread Interrupt.
ja: スレッドは、スレッド割り込みによって設定された割り込み可能になる条件を満たすのに十分な時間実行されていない。

source: The thread will exit.
ja: スレッドが終了します。

source: The thread's DPI awareness may temporarily change while the user is moving one of the script's windows, or while the script is displaying a dialog.
ja: ユーザーがスクリプトのウィンドウを移動しているときや、スクリプトがダイアログを表示しているときに、スレッドのDPI認識が一時的に変更されることがあります。

source: The thrown value, usually an Error object.
ja: 投げられた値（通常はErrorオブジェクト）。

source: The tick marks at the starting and ending positions of a selection range are displayed as triangles (instead of vertical dashes), and the selection range is highlighted (highlighting might require that the theme be removed via GuiObj.Opt("-Theme")).
ja: 選択範囲の開始位置と終了位置の目盛りが（垂直のダッシュの代わりに）三角形で表示され、選択範囲が強調表示されます（強調表示には、GuiObj.Opt("-Theme")によってテーマを削除する必要があるかもしれません）。

source: The time is your own local time, not UTC/GMT.
ja: 時刻はUTC/GMTではなく、ご自身の現地時間です。

source: The time the current subkey or any of its values was last modified.
ja: 現在のサブキーまたはその値のいずれかが最後に変更された時刻。

source: The time the file was created.
ja: ファイルが作成された時刻です。

source: The time the file was last accessed.
ja: ファイルが最後にアクセスされた時刻です。

source: The time the file was last modified.
ja: ファイルが最後に更新された時刻。

source: The time will be set to 4:55pm.
ja: 時刻は16時55分に設定されます。

source: The timeout period ordinarily starts when Start is called, but will restart if this property is assigned a value while Input is in progress.
ja: 通常、タイムアウトはStartが呼ばれた時点で開始されるが、Inputの実行中に本プロパティに値が代入された場合は、再開されます。

source: The timeout should be set to a value less than the amount of time that the user typically holds down a hotkey's modifiers before releasing them.
ja: タイムアウトは、ユーザーが通常ホットキーの修飾子を押したまま離す時間よりも短い値に設定する必要があります。

source: The timeout value can be a floating point number such as 2.5, but it should not be a hexadecimal value such as 0x03.
ja: タイムアウト値には、2.5などの浮動小数点数を指定できますが、0x03などの16進数値を指定してはいけません。

source: The timeout value to apply globally, in milliseconds.
ja: グローバルに適用するタイムアウト値（ミリ秒単位）。

source: The timer has been interrupted by another thread, namely another timed function, hotkey subroutine, or custom menu item (this can be avoided via Critical).
ja: タイマーが他のスレッド、すなわち他のタイマー付き関数、ホットキーサブルーチン、またはカスタムメニュー項目によって中断された（これはCriticalによって回避することができます）。

source: The timer will be automatically reset.
ja: タイマーは自動的にリセットされます。

source: The timer's function is still running when the timer period expires again.
ja: 再びタイマー期間が終了しても、タイマーの機能は作動しています。

source: The title can be specified as a parameter of Gui() or via the Gui.Title property.
ja: タイトルはGui()のパラメータとして、またはGui.Titleプロパティで指定することができます。

source: The title can be specified as a parameter of Gui() or via the GuiObj.Title property.
ja: タイトルはGui()のパラメータとして、またはGuiObj.Titleプロパティで指定することができます。

source: The title is correct only for systems with UI language set to English.
ja: タイトルは、UI言語が英語に設定されているシステムでのみ正しく表示されます。

source: The title is repeated unnecessarily.
ja: タイトルが不必要に繰り返されている。

source: The title of its main window has been changed.
ja: そのメインウィンドウのタイトルが変更されました。

source: The title of the file-selection window.
ja: ファイル選択ウィンドウのタイトルです。

source: The title of the input box.
ja: 入力ボックスのタイトルです。

source: The title of the message box window.
ja: メッセージボックスのウィンドウのタイトルです。

source: The title of the script's main window is used by the #SingleInstance and Reload mechanisms to identify other instances of the same script.
ja: スクリプトのメインウィンドウのタイトルは、#SingleInstanceおよびReloadメカニズムによって、同じスクリプトの他のインスタンスを識別するために使用されます。

source: The title of the window.
ja: ウィンドウのタイトル。

source: The title refers to both versions.
ja: タイトルは両バージョンを指しています。

source: The title will be blank if the Title parameter is an empty string.
ja: Titleパラメータが空文字列の場合、タイトルは空白となります。

source: The tooltip is displayed until one of the following occurs:
ja: ツールチップは以下のいずれかが発生するまで表示される：

source: The tooltip might never appear on certain OS versions.
ja: OSのバージョンによってはツールチップが表示されない場合があります。

source: The top row is 1, the second row is 2, and so on.
ja: 一番上の列が1、2番目の列が2、といった具合です。

source: The trailing colon should not be included.
ja: 末尾のコロンは含まれません。

source: The translation from v1-command to function is generally as follows (but some functions have been changed, as documented further below):
ja: v1コマンドから関数への変換は概ね以下の通りです（ただし、一部の関数は後述するように変更されています）：

source: The tray icon can be made to disappear or reappear at any time during the execution of the script by assigning a true or false value to A_IconHidden.
ja: A_IconHiddenにtrueまたはfalseを指定することで、スクリプト実行中の任意のタイミングでトレイアイコンを消失または再出現させることができます。

source: The tray icon usually looks like this:
ja: トレイアイコンは通常このようになっている：

source: The tray icon's tooltip can be changed by assigning a value to A_IconTip.
ja: トレイアイコンのツールチップは、A_IconTipに値を代入することで変更できる。

source: The two anchors may be combined.
ja: 2つのアンカーを組み合わせることもできる。

source: The two strings are joined together (concatenated) before being passed to the SendText function.
ja: 2つの文字列は、SendText関数に渡される前に結合（連結）されます。

source: The type of mouse cursor currently being displayed.
ja: 現在表示されているマウスカーソルの種類。

source: The type of structure depends on the notification code and the type of control which raised the notification, but is always based on NMHDR.
ja: 構造の種類は、通知コードと通知を行ったコントロールの種類によって異なりますが、常にNMHDRをベースにしています。

source: The type of target to affect.
ja: 影響を与える対象の種類を指定します。

source: The type of the currently retrieved item, which is one of the following words:
ja: 現在検索されているアイテムのタイプで、以下の単語のいずれかです：

source: The type of the currently retrieved item, which is one of the following words: KEY (i.e. the currently retrieved item is a subkey not a value), REG_SZ, REG_EXPAND_SZ, REG_MULTI_SZ, REG_DWORD, REG_QWORD, REG_BINARY, REG_LINK, REG_RESOURCE_LIST, REG_FULL_RESOURCE_DESCRIPTOR, REG_RESOURCE_REQUIREMENTS_LIST, REG_DWORD_BIG_ENDIAN (probably rare on most Windows hardware).
ja: 現在検索されているアイテムのタイプで、以下の単語のいずれかです：KEY（つまり、現在検索されている項目は値ではなくサブキー）、REG_SZ、REG_EXPAND_SZ、REG_MULTI_SZ、REG_DWORD、REG_QWORD、REG_BINARY、REG_LINK、REG_RESOURCE_LIST、REG_FULL_RESOURCE_DESCRIPTOR、 REG_RESOURCE_REQUIREMENTS_LIST、REG_DWORD_BIG_ENDIAN （ほとんどのWindowsハードでは稀でしょうね）。

source: The type of the resource (as an integer or string) can be explicitly specified by prepending an asterisk to it:
ja: リソースのタイプ（整数または文字列）を明示的に指定するには、その前にアスタリスクを付ける：

source: The type of the resource (as an integer or string) can be explicitly specified by prepending an asterisk to it: *type Filename.
ja: リソースのタイプ（整数または文字列）を明示的に指定するには、その前にアスタリスクを付ける：*type Filename。

source: The type of warning to enable or disable.
ja: 有効または無効にする警告の種類を指定します。

source: The underlying system functions do not always report failure, so an exception may or may not be thrown.
ja: 基礎となるシステム関数が常に失敗を報告するとは限らないため、例外が発生する場合もあれば、発生しない場合もあります。

source: The unique ID (HWND/handle) of the script's hidden main window.
ja: スクリプトの隠されたメイン・ウィンドウの固有ID（HWND/ハンドル）。

source: The upper-left pixel of the screen is at 0, 0.
ja: 画面左上のピクセルは0, 0にある。

source: The uppercase letters A-Z are considered identical to their lowercase counterparts for the purpose of the sort.
ja: 大文字のA-Zは、小文字のA-Zと同じとみなされます。

source: The usage of these methods and properties is not 1:1.
ja: これらのメソッドやプロパティの使い方は、1:1 ではありません。

source: The use of Break and Continue inside a loop are encouraged as alternatives to Goto, since they generally make a script more understandable and maintainable.
ja: ループの中でBreakや Continueを使うことは、一般にスクリプトをより理解しやすく、保守しやすくするため、Gotoに代わるものとして推奨されています。

source: The use of Break and Continue are encouraged over Goto since they usually make scripts more readable and maintainable.
ja: BreakとContinueの使用は、通常、スクリプトをより読みやすく、保守的にするため、Gotoよりも推奨されています。

source: The use of break and continue inside a loop are encouraged as alternatives to goto, since they generally make a script more understandable and maintainable.
ja: ループの中でbreakや continueを使うことは、一般にスクリプトをより理解しやすく、保守しやすくするため、gotoに代わるものとして推奨されています。

source: The use of Object(obj) and Object(ptr) to convert between a reference and a pointer was shifted to separate functions, ObjPtrAddRef(obj) and ObjFromPtrAddRef(ptr).
ja: Object(obj)とObject(ptr)を使って参照とポインタの変換を行っていましたが、ObjPtrAddRef(obj)とObjFromPtrAddRef(ptr)という別の関数に移行されました。

source: The use of [] is reserved for data (such as array elements).
ja: []は、データ（配列要素など）に使用します。

source: The use of Goto is discouraged because it generally makes scripts less readable and harder to maintain.
ja: Gotoの使用は、一般にスクリプトの可読性を低下させ、保守を困難にするため、推奨されません。

source: The use of ampersand (&) to indicate the underlined letter in a menu item is usually not necessary (i.e. &File is the same as File).
ja: メニュー項目の下線文字を示すアンパサンド（&）の使用は通常必要ありません（例：&FileはFileと同じです）。

source: The use of ampersand (&) to indicate the underlined letter in a menu item is usually not necessary (i.e. "&File" is the same as "File").
ja: メニュー項目の下線文字を示すアンパサンド（&）の使用は通常必要ありません（例："&File"は"File"と同じです）。
